{
    "map": {
        "cells": [
            [
                null,
                null,
                null
            ],
            [
                null,
                null,
                null
            ],
            [
                null,
                null,
                null
            ],
            [
                null,
                null,
                null
            ]
        ]
    },
    "players": [],
    "weaponsDeck": {
      "cards": [
        {
          "id": 1,
          "name": "Distruttore",
          "loaded": true,
          "color": "Blue",
          "notes": ""
        },
        {
          "id": 2,
          "name": "Mitragliatrice",
          "loaded": true,
          "color": "Blue",
          "notes": "Se hai dato entrambi i punti aggiuntivi di danno, devono essere dati a 2 bersagli diversi. Se puoi vedere solo 2 bersagli, dai 2 danni a entrambi se usi entrambi gli effetti opzionali. Se usi l'effetto base solo su 1 bersaglio, puoi comunque usare il tripode di supporto per dare 1 danno aggiuntivo."
        },
        {
          "id": 3,
          "name": "Torpedine",
          "loaded": true,
          "color": "Blue",
          "notes": "Questa carta limita l'ordine in cui puoi utilizzare i suoi effetti. (Molte carte non lo fanno.) Inoltre ogni bersaglio deve essere un giocatore differente."
        },
        {
          "id": 4,
          "name": "Fucile al plasma",
          "loaded": true,
          "color": "Blue",
          "notes": "I due movimenti non hanno costo in munizioni. Non hai bisogno di vedere il tuo bersaglio quando giochi la carta. Per esempio puoi muovere di 2 quadrati e sparare al bersaglio che ora puoi vedere. Non puoi usare 1 movimento prima di sparare e 1 dopo aver sparato."
        },
        {
          "id": 5,
          "name": "Fucile di precisione",
          "loaded": true,
          "color": "Blue",
          "notes": "Per esempio, nella stanza 2x2, non puoi sparare a un bersaglio in un quadrato adiacente, ma puoi sparare a un bersaglio lungo la diagonale. Se sei vicino a una porta non puoi sparare a un bersaglio dall'altra parte della porta, ma puoi sparare a un bersaglio su un quadrato diverso in quella stanza."
        },
        {
          "id": 6,
          "name": "Falce protonica",
          "loaded": true,
          "color": "Blue",
          "notes": ""
        },
        {
          "id": 7,
          "name": "Raggio traente",
          "loaded": true,
          "color": "Blue",
          "notes": "Puoi muovere un bersaglio anche se non puoi vederlo. Il bersaglio finisce in una posizione in cui puoi vederlo e danneggiarlo. I movimenti possono non essere nella stessa direzione."
        },
        {
          "id": 8,
          "name": "Cannone vortex",
          "loaded": true,
          "color": "Red",
          "notes": "I 3 bersagli devono essere diversi, ma alcuni di loro potrebbero partire dallo stesso quadrato (anche nel quadrato in cui ti trovi tu). Finiscono tutti sullo stesso quadrato con il vortice. Non hai bisogno di vedere i bersagli. Spari al quadrato che puoi vedere, crei un vortice lì e i tuoi bersagli vi vengono risucchiati."
        },
        {
          "id": 9,
          "name": "Vulcanizzatore",
          "loaded": true,
          "color": "Red",
          "notes": ""
        },
        {
          "id": 10,
          "name": "Razzo termico",
          "loaded": true,
          "color": "Red",
          "notes": "Si, può colpire solo bersagli che non puoi vedere."
        },
        {
          "id": 10,
          "name": "Raggio solare",
          "loaded": true,
          "color": "Red",
          "notes": ""
        },
        {
          "id": 11,
          "name": "Lanciafiamme",
          "loaded": true,
          "color": "Red",
          "notes": "Quest'arma non può danneggiare nessuno nel tuo quadrato. Tuttavia può a volte danneggiare un bersaglio che non vedi, le fiamme non passano attraverso i muri ma passano attraverso le porte. Immaginatelo come una esplosione di fuoco in linea retta che si muove di 2 quadrati in una direzione cardinale."
        },
        {
          "id": 12,
          "name": "Lanciagranate",
          "loaded": true,
          "color": "Red",
          "notes": "Per esempio puoi sparare a un bersaglio, muoverlo in un quadrato con altri bersagli e danneggiare chiunque, incluso il primo bersaglio. Oppure puoi dare 2 danni a un bersaglio principale e 1 a tutti gli altri in quel quadrato, e poi muovere il bersaglio principale. Oppure puoi dare 1 danno a un bersaglio isolato e 1 a chiunque in quadrato diverso. Se bersagli il quadrato in cui ti trovi non potrai essere mosso o danneggiato."
        },
        {
          "id": 13,
          "name": "Lanciarazzi",
          "loaded": true,
          "color": "Red",
          "notes": "Se usi i razzi portatili prima dell'effetto base considera solo il tuo nuovo quadrato per determinare se il bersaglio è valido. Puoi anche spostarti di 1 quadrato per potergli sparare. Usando la testata a frammentazione dai danno a chiunque si trovi nel quadrato in cui il bersaglio si trovava prima di muoversi. Il bersaglio riceve così 3 danni in totale."
        },
        {
          "id": 14,
          "name": "Fucile laser",
          "loaded": true,
          "color": "Yellow",
          "notes": "In pratica spari in linea retta ignorando i muri. Non hai bisogno di scegliere un bersaglio dall'altro lato del muro, potrebbe anche essere qualcuno nel tuo stesso quadrato, ma sparare attraverso i muri è sicuramente divertente. Ci sono solo 4 direzioni cardinali. Immagina di essere di fronte a un muro o una porta, imbracciare il fucile e sparare in quella direzione. Chiunque si trovi su un quadrato in quella direzione (incluso il tuo) è un bersaglio valido. In modalità perforazione i 2 bersagli possono essere nello stesso quadrato o in quadrati diversi."
        },
        {
          "id": 15,
          "name": "Spada fotonica",
          "loaded": true,
          "color": "Yellow",
          "notes": "Combinare tutti gli effetti permette di muoversi in un quadrato e colpire 2 persone; oppure di colpire qualcuno, muovere e colpire qualcun altro. Oppure ancora colpire 2 persone e poi andare via."
        },
        {
          "id": 16,
          "name": "ZX-2",
          "loaded": true,
          "color": "Yellow",
          "notes": "Ricorda che i 3 bersagli possono anche essere in 3 stanze diverse."
        },
        {
          "id": 17,
          "name": "Fucile a pompa",
          "loaded": true,
          "color": "Yellow",
          "notes": ""
        },
        {
          "id": 18,
          "name": "Cyberguanto",
          "loaded": true,
          "color": "Yellow",
          "notes": "Nella modalità cento pugni stai volando per 2 quadrati in linea retta, prendendo a pugni 1 persona per quadrato."
        },
        {
          "id": 19,
          "name": "Onda d'urto",
          "loaded": true,
          "color": "Yellow",
          "notes": ""
        },
        {
          "id": 20,
          "name": "Martello ionico",
          "loaded": true,
          "color": "Yellow",
          "notes": "Ricordati che i movimenti passano attraverso le porte ma non attraverso le pareti."
        }
      ]
    },
    "powersDeck": {
        "scraps": [],
        "cards": [
            {
                "id": 1,
                "name": "Mirino",
                "color": "Red",
                "description" : "Puoi giocare questa carta quando stai dando danno a uno o più bersagli. Paga 1 cubo munizioni di qualsiasi colore. Scegli 1 dei bersagli e dagli 1  segnalino danno aggiuntivo. Nota: non puoi usare questo potenziamento per dare 1 danno a un bersaglio che sta solo ricevendo marchi."
            },
            {
                "id": 2,
                "name": "Raggio Cinetico",
                "color": "Blue",
                "description" : "Puoi giocare questa carta nel tuo turno prima o dopo aver svolto qualsiasi azione. Scegli la miniatura di un altro giocatore e muovila di 1 o 2 quadrati in una direzione. (Non puoi usare questo potenziamento per muovere una miniatura dopo che è stata rigenerata alla fine del tuo turno, è troppo tardi.)"
            },
            {
                "id": 3,
                "name": "Granata Venom",
                "color": "Yellow",
                "description" : "Puoi giocare questa carta quando ricevi un danno da un giocatore che puoi vedere. Dai 1 marchio a quel giocatore"
            },
            {
                "id": 4,
                "name": "Teletrasporto",
                "color": "Yellow",
                "description" : "Puoi giocare questa carta nel tuo turno prima o  dopo aver svolto qualsiasi azione. Prendi la tua miniatura e piazzala in un qualsiasi quadrato sulla plancia. (Non puoi usare questo potenziamento dopo che hai visto dove un altro giocatore si rigenera alla fine del tuo turno, è troppo tardi."
            }
        ]
    },
    "ammoDeck": {
        "scraps": [],
        "cards": [
            {
                "content": [
                    "Red",
                    "Yellow",
                    "Yellow"
                ]
            },
            {
                "content": [
                    "Blue",
                    "Red",
                    "Red"
                ]
            },
            {
                "content": [
                    "Power",
                    "Blue",
                    "Red"
                ]
            },
            {
                "content": [
                    "Power",
                    "Yellow",
                    "Red"
                ]
            },
            {
                "content": [
                    "Yellow",
                    "Blue",
                    "Blue"
                ]
            },
            {
                "content": [
                    "Red",
                    "Blue",
                    "Blue"
                ]
            },
            {
                "content": [
                    "Power",
                    "Blue",
                    "Blue"
                ]
            }
        ]
    },
    "skullsBoard": [
        {
            "skull": true,
            "overkill": false
        },
        {
            "skull": true,
            "overkill": false
        },
        {
            "skull": true,
            "overkill": false
        },
        {
            "skull": true,
            "overkill": false
        },
        {
            "skull": true,
            "overkill": false
        },
        {
            "skull": false,
            "overkill": false
        },
        {
            "skull": false,
            "overkill": false
        },
        {
            "skull": false,
            "overkill": false
        }
    ]
}